city_name = {

    "ABD": "آبادان",

    "AKW": "آقاجاری",

    "AEU": "ابوموسی",

    "AJK": "اراک",

    "ADU": "اردبیل",

    "OMH": "ارومیه",

    "IFN": "اصفهان",

    "OMI": "امیدیه",

    "AWZ": "اهواز",

    "IHR": "ایران شهر",

    "IIL": "ایلام",

    "BBL": "بابلسر",

    "BJB": "بجنورد",

    "BXR": "بم",

    "BND": "بندر عباس",

    "BDH": "بندر لنگه",

    "MRX": "بندر ماهشهر",

    "IAQ": "بهرگان",

    "BUZ": "بوشهر",

    "XBJ": "بیرجند",

    "BSM": "بیشه کلا",

    "PFQ": "پارس آباد",

    "TBZ": "تبریز",

    "TCX": "تبس",

    "IKA": "تهران",

    "THR": "تهران",

    "TEW": "توحید",

    "KHK": "جزیره خارک",

    "SXI": "جزیره سیری",

    "KIH": "جزیره کیش",

    "JYR": "جیرفت",

    "ZBR": "چابهار",

    "KHA": "خانه",

    "KHD": "خرم آباد",

    "KHY": "خوی",

    "DEF": "دزفول",

    "RZR": "رامسر",

    "RAS": "رشت",

    "RJN": "رفسنجان",

    "ACZ": "زابل",

    "ZAH": "زاهدان",

    "JWN": "زنجان",

    "SRY": "ساری",

    "AFZ": "سبزوار",

    "CKT": "سرخس",

    "SDG": "سنندج",

    "ACP": "سهند",

    "SYJ": "سیرجان",

    "CQD": "شهر کرد",

    "SYZ": "شیراز",

    "PGU": "عسلویه",

    "FAZ": "فاسا",

    "GZW": "قزوین",

    "GSM": "قشم",

    "GCH": "گچساران",

    "GBT": "گورگن",

    "LRR": "لار",

    "LFM": "لامرد",

    "LVP": "لاوان",

    "MHD": "مشهد",

    "NUJ": "نوژه",

    "NSH": "نوشهر",

    "IFH": "هسا",

    "HDM": "همدان",

    "HDR": "هوادریا",

    "KNR": "کانگان",

    "KER": "کرمان",

    "KSH": "کرمانشاه",

    "KLM": "کلاله",

    "YES": "یاسوج",

    "AZD": "یزد"

}


def jalali_to_gregorian(jy, jm, jd):
    jy += 1595
    days = -355668 + (365 * jy) + ((jy // 33) * 8) + (((jy % 33) + 3) // 4) + jd
    if (jm < 7):
        days += (jm - 1) * 31
    else:
        days += ((jm - 7) * 30) + 186
    gy = 400 * (days // 146097)
    days %= 146097
    if (days > 36524):
        days -= 1
        gy += 100 * (days // 36524)
        days %= 36524
        if (days >= 365):
            days += 1
    gy += 4 * (days // 1461)
    days %= 1461
    if (days > 365):
        gy += ((days - 1) // 365)
        days = (days - 1) % 365
    gd = days + 1
    if ((gy % 4 == 0 and gy % 100 != 0) or (gy % 400 == 0)):
        kab = 29
    else:
        kab = 28
    sal_a = [0, 31, kab, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
    gm = 0
    while (gm < 13 and gd > sal_a[gm]):
        gd -= sal_a[gm]
        gm += 1
    return [gy, gm, gd]
